Tekla Open API Reference for Tekla Structures 2025
AnalysisArea Methods
The AnalysisArea type exposes the following members.
Methods
Name | Description
Delete
 Deletes an analysis area. Method is not implemented yet.
GetAreaHoles
 Gets the area holes of the analysis area.
GetInnerPositions
 Gets the inner positions of the analysis area.
Modify
 Modifies an analysis area. Method is not implemented yet.
Select
 Selects an analysis area. The AnalysisModelName and ID have to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisArea Class
Tekla.Structures.Analysis Namespace